app/controllers/admin/heuristics_controller.rb

INSERT INTO "admin_heuristics" ("name", "description", "device_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Heuristicas de Nilsen"], ["description", "Heuristicas de Nilsen "], ["device_id", 3], ["created_at", "2016-11-16 20:12:31.439069"], ["updated_at", "2016-11-16 20:12:31.439069"]]
---
  def create
    @admin_heuristic = Admin::Heuristic.new(admin_heuristic_params)

    respond_to do |format|
      if @admin_heuristic.save