app/controllers/profile/projects_controller.rb

SELECT  profile_projects.*, COUNT(profile_evaluations.id) AS num_eval FROM "profile_projects" LEFT OUTER JOIN profile_evaluations ON profile_evaluations.project_id = profile_projects.id WHERE "profile_projects"."user_id" = ? GROUP BY profile_projects.id  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["user_id", 2]]
---
  def index
    @profile_projects = Profile::Project.select('profile_projects.*, COUNT(profile_evaluations.id) AS num_eval').joins('LEFT OUTER JOIN profile_evaluations ON profile_evaluations.project_id = profile_projects.id').group('profile_projects.id').where(user_id: current_user.id).paginate(page: params[:page], per_page: 10).order("created_at DESC")