app/controllers/profile_controller.rb

  def index
  	if params[:user]
  		@user_data = User.where(id: params[:user]).first
      @user_projects = Profile::Project.select('profile_projects.*, COUNT(profile_evaluations.id) AS num_eval').joins('LEFT OUTER JOIN profile_evaluations ON profile_evaluations.project_id = profile_projects.id').group('profile_projects.id').where(user_id: params[:user]).order('created_at DESC').limit(3)
      @user_avaliac = Profile::Evaluation.where(user_id: params[:user])
      @rating = Rating.where(user_id: params[:user], evaluator_id: current_user.id).first
      unless @rating
        @rating = Rating.create(user_id: params[:user], evaluator_id: current_user.id, score: 0)
      end
  	else
  		@user_data = User.where(id: current_user.id).first
      @user_projects = Profile::Project.select('profile_projects.*, COUNT(profile_evaluations.id) AS num_eval').joins('LEFT OUTER JOIN profile_evaluations ON profile_evaluations.project_id = profile_projects.id').group('profile_projects.id').where(user_id: current_user.id).order('created_at DESC').limit(6)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  ORDER BY "ratings"."id" ASC LIMIT 1  [["user_id", 2]]
INSERT INTO "ratings" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2016-11-16 20:13:13.517372"], ["updated_at", "2016-11-16 20:13:13.517372"]]
SELECT AVG("ratings"."score") FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 2]]
SELECT  profile_projects.*, COUNT(profile_evaluations.id) AS num_eval FROM "profile_projects" LEFT OUTER JOIN profile_evaluations ON profile_evaluations.project_id = profile_projects.id WHERE "profile_projects"."user_id" = ? GROUP BY profile_projects.id  ORDER BY created_at DESC LIMIT 6  [["user_id", 2]]