app/views/profile/index.html.erb

						    		<div class="col-md-2" style="padding:2px 10px 0px">
						    		<% if avaliac.project.user.avatar.exists? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]